app/views/analytics/index.html.erb


Total clicks: <%= shorten_url.analytics.count %><br>
---
SELECT "analytics".* FROM "analytics" WHERE "analytics"."shorten_url_id" IN ($1, $2)  [["shorten_url_id", 2], ["shorten_url_id", 3]]
SELECT COUNT(*) FROM "analytics" WHERE "analytics"."shorten_url_id" = $1  [["shorten_url_id", 1]]