app/controllers/analytics_controller.rb

  def index
    @shorten_urls = ShortenUrl.includes(:analytics)
---
SELECT "analytics".* FROM "analytics" WHERE "analytics"."shorten_url_id" IN ($1, $2)  [["shorten_url_id", 2], ["shorten_url_id", 3]]
SELECT "shorten_urls".* FROM "shorten_urls"