app/controllers/shorten_urls_controller.rb

SELECT "shorten_urls".* FROM "shorten_urls"
---
  def index
    @shorten_url = ShortenUrl.new
    @existing_urls = ShortenUrl.all

INSERT INTO "shorten_urls" ("original_url", "short_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["original_url", "google.com"], ["short_url", "bgvwl"], ["created_at", "2020-08-15 15:52:20.229332"], ["updated_at", "2020-08-15 15:52:20.229332"]]
---
  def create
    @shorten_url = ShortenUrl.new(shorten_url_params)
    if @shorten_url.save

SELECT "shorten_urls".* FROM "shorten_urls" WHERE "shorten_urls"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "analytics" ("ip_address", "shorten_url_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["ip_address", 0.0], ["shorten_url_id", 3], ["created_at", "2020-08-15 18:10:55.603071"], ["updated_at", "2020-08-15 18:10:55.603071"]]
---
  def set_analytics
    @shorten_url = ShortenUrl.find(params[:id])
    @shorten_url.analytics.create!(ip_address: request.ip, country: request.location.country)