app/models/shorten_url.rb

SELECT "shorten_urls".* FROM "shorten_urls" WHERE "shorten_urls"."short_url" = $1  [["short_url", "acxjo"]]
SELECT "shorten_urls".* FROM "shorten_urls" WHERE "shorten_urls"."short_url" = $1  [["short_url", "0sh1m"]]
---
  def set_short_url
    url = [*('a'..'z'), *(0..9)].sample(5).join
    existing_url = ShortenUrl.where(short_url: url)
    if existing_url.present?